#### Terraform Format and Style 🖌`success`
#### Terraform Validation 🤖`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mysticx/recipe-app-api-devops/runs/run-zMLw9S3C8UgqtE3N

Waiting for the plan to start...

Terraform v1.3.5
on linux_amd64
Initializing plugins and modules...
data.aws_region.current: Reading...
data.aws_ami.amazon_linux: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-3]
data.aws_ami.amazon_linux: Read complete after 0s [id=ami-03c2abbbe8af9a7e6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.api_container_definitions will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "api_container_definitions" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment       = [
                      + {
                          + name  = "DJANGO_SECRET_KEY"
                          + value = "${django_secret_key}"
                        },
                      + {
                          + name  = "DB_HOST"
                          + value = "${db_host}"
                        },
                      + {
                          + name  = "DB_NAME"
                          + value = "${db_name}"
                        },
                      + {
                          + name  = "DB_USER"
                          + value = "${db_user}"
                        },
                      + {
                          + name  = "DB_PASS"
                          + value = "${db_pass}"
                        },
                      + {
                          + name  = "ALLOWED_HOSTS"
                          + value = "${allowed_hosts}"
                        },
                    ]
                  + essential         = true
                  + image             = "${app_image}"
                  + logConfiguration  = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${log_group_name}"
                          + awslogs-region        = "${log_group_region}"
                          + awslogs-stream-prefix = "api"
                        }
                    }
                  + memoryReservation = 256
                  + mountPoints       = [
                      + {
                          + containerPath = "/vol/web"
                          + readOnly      = false
                          + sourceVolume  = "static"
                        },
                    ]
                  + name              = "api"
                  + portMappings      = [
                      + {
                          + containerPort = 9000
                          + hostPort      = 9000
                        },
                    ]
                },
              + {
                  + environment       = [
                      + {
                          + name  = "APP_HOST"
                          + value = "127.0.0.1"
                        },
                      + {
                          + name  = "APP_PORT"
                          + value = "9000"
                        },
                      + {
                          + name  = "LISTEN_PORT"
                          + value = "8000"
                        },
                    ]
                  + essential         = true
                  + image             = "${proxy_image}"
                  + logConfiguration  = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${log_group_name}"
                          + awslogs-region        = "${log_group_region}"
                          + awslogs-stream-prefix = "proxy"
                        }
                    }
                  + memoryReservation = 256
                  + mountPoints       = [
                      + {
                          + containerPath = "/vol/static"
                          + readOnly      = true
                          + sourceVolume  = "static"
                        },
                    ]
                  + name              = "proxy"
                  + portMappings      = [
                      + {
                          + containerPort = 8000
                          + hostPort      = 8000
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "allowed_hosts"     = (known after apply)
          + "app_image"         = "166526365211.dkr.ecr.eu-west-3.amazonaws.com/recipe-app-api-devops:latest"
          + "db_host"           = (known after apply)
          + "db_name"           = "recipe"
          + "db_pass"           = (sensitive value)
          + "db_user"           = "recipe-app"
          + "django_secret_key" = (sensitive value)
          + "log_group_name"    = "recipe-app-api-devops-api"
          + "log_group_region"  = "eu-west-3"
          + "proxy_image"       = "166526365211.dkr.ecr.eu-west-3.amazonaws.com/recipe-app-api-proxy:latest"
        }
    }

  # aws_cloudwatch_log_group.ecs_task_logs will be created
  + resource "aws_cloudwatch_log_group" "ecs_task_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "recipe-app-api-devops-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags_all          = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
    }

  # aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 0
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "recipe"
      + db_subnet_group_name                  = "db_group-recipe-app-api-devops"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "11.15"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "recipe-app-api-devops-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Name" = "recipe-app-api-devops-db"
        }
      + tags_all                              = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "recipe-app-api-devops-db"
          + "Terraform"   = "True"
        }
      + timezone                              = (known after apply)
      + username                              = "recipe-app"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.main_subnet_group will be created
  + resource "aws_db_subnet_group" "main_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "db_group-recipe-app-api-devops"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "db_group-recipe-app-api-devops"
        }
      + tags_all                = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "db_group-recipe-app-api-devops"
          + "Terraform"   = "True"
        }
    }

  # aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "recipe-app-api-devops-cluster"
      + tags_all           = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.api will be created
  + resource "aws_ecs_service" "api" {
      + cluster                            = "recipe-app-api-devops-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "recipe-app-api-devops-api"
      + platform_version                   = "1.4.0"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
      + task_definition                    = "recipe-app-api-devops-api"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "proxy"
          + container_port   = 8000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.api will be created
  + resource "aws_ecs_task_definition" "api" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "recipe-app-api-devops-api"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
      + task_role_arn            = (known after apply)

      + volume {
          + name = "static"
        }
    }

  # aws_iam_instance_profile.bastion will be created
  + resource "aws_iam_instance_profile" "bastion" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "bastion-instance-profile"
      + path        = "/"
      + role        = "iamrole-bastion"
      + tags_all    = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.task_execution_role_policy will be created
  + resource "aws_iam_policy" "task_execution_role_policy" {
      + arn         = (known after apply)
      + description = "Allow retrieving images and adding to logs"
      + id          = (known after apply)
      + name        = "recipe-app-api-devops-task-exec-role-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
    }

  # aws_iam_role.app_iam_role will be created
  + resource "aws_iam_role" "app_iam_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "recipe-app-api-devops-api-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.bastion will be created
  + resource "aws_iam_role" "bastion" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iamrole-bastion"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.task_execution_role will be created
  + resource "aws_iam_role" "task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "recipe-app-api-devops-task-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.bastion_attach_policy will be created
  + resource "aws_iam_role_policy_attachment" "bastion_attach_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "iamrole-bastion"
    }

  # aws_iam_role_policy_attachment.task_execution_role will be created
  + resource "aws_iam_role_policy_attachment" "task_execution_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "recipe-app-api-devops-task-exec-role"
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-03c2abbbe8af9a7e6"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "bastion-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "bastion-recipe-app-api-devops"
        }
      + tags_all                             = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "bastion-recipe-app-api-devops"
          + "Terraform"   = "True"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "309b35916070e41021dd275e5fba2b9ef4bcbbfa"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_key_pair.bastion_kp will be created
  + resource "aws_key_pair" "bastion_kp" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "recipe-app-api-devops-bastion"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHjoaUsZBPUAXIhv9JL8riFean8nEXIXVN1d61mC1CO8PTG6BcPrrY0W1JPtDAsU+x4TBJV9EQm7vYXAZEIXe7KwkeTL61alU8U6mG6nCXllinSysJGPoFjCwdzgcu58h6M7WL3nODbZh6e/9PPLmP/Ufb1S1RQdOoTQMJaHh0bo9AIN8JmPjBOIJitGRYs4tFyVHjGU4YGOw3evDwW9qITcJ/uJSvxqQy81zQ4tM+pdW41t+Lm1qsEOlrqibvj2yPU0XuyHDlUXW8XGKzQFrMJNgBopdpWaE8Hk8egljH6TVjFkWhVzg1H60DzZm/oZDjEnmFxnp7hMPhE9n49cb3rnowWiE8av1bmT89/R10sg+WpPT53EXOMb5BK6lescDv2T/fD2/b3oVDsO4fnFEdYqA2uoqZN9cQw66owzZAKqezfi3RiR2wVYAafe78G3n6X3W3PslTGxRDkcQ/mtcIICRQTPiJkqlIA4iORtPBsl2vJIBrciWxK/QDgiOxD/M= user@DESKTOP-JS87L9H"
      + tags_all        = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
    }

  # aws_lb.api will be created
  + resource "aws_lb" "api" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = true
      + enable_deletion_protection = true
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "recipe-app-api-devops-main"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.api will be created
  + resource "aws_lb_listener" "api" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.api will be created
  + resource "aws_lb_target_group" "api" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "recipe-app-api-devops-api"
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/admin/login/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_security_group.bastion_sg will be created
  + resource "aws_security_group" "bastion_sg" {
      + arn                    = (known after apply)
      + description            = "Control bastion ingress and egress access"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "recipe-app-api-devops-bastion_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "bastion_sg"
        }
      + tags_all               = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "bastion_sg"
          + "Terraform"   = "True"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ecs_sg will be created
  + resource "aws_security_group" "ecs_sg" {
      + arn                    = (known after apply)
      + description            = "Access for the ECS service"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "recipe-app-api-devops-ecs-service"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ecs_sg"
        }
      + tags_all               = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "ecs_sg"
          + "Terraform"   = "True"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lb will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "Allow access to Application Load Balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "lb_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Terraform"   = "True"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.rds_sg will be created
  + resource "aws_security_group" "rds_sg" {
      + arn                    = (known after apply)
      + description            = "Allow access to the RDS database instance."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "recipe-app-api-devops-rds-inbound-access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rds_sg"
        }
      + tags_all               = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "rds_sg"
          + "Terraform"   = "True"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.allow_8000_ecs_sg will be created
  + resource "aws_security_group_rule" "allow_8000_ecs_sg" {
      + description              = "Allow port TCP:8000 igress"
      + from_port                = 8000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8000
      + type                     = "ingress"
    }

  # aws_security_group_rule.allow_8000_lb will be created
  + resource "aws_security_group_rule" "allow_8000_lb" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow 8000 egress"
      + from_port                = 8000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8000
      + type                     = "egress"
    }

  # aws_security_group_rule.allow_http_egress_bastion_sg will be created
  + resource "aws_security_group_rule" "allow_http_egress_bastion_sg" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow http egress"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # aws_security_group_rule.allow_http_lb will be created
  + resource "aws_security_group_rule" "allow_http_lb" {
      + cidr_blocks              = [
          + "176.147.76.8/32",
        ]
      + description              = "Allow HTTP igress"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.allow_https_ecs_sg will be created
  + resource "aws_security_group_rule" "allow_https_ecs_sg" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTPS egress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.allow_https_egress_bastion_sg will be created
  + resource "aws_security_group_rule" "allow_https_egress_bastion_sg" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow https egress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.allow_postgre_rds_sg will be created
  + resource "aws_security_group_rule" "allow_postgre_rds_sg" {
      + description              = "Allow port TCP:5432 igress from bastion"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_security_group_rule.allow_postgre_rds_sg_2 will be created
  + resource "aws_security_group_rule" "allow_postgre_rds_sg_2" {
      + description              = "Allow port TCP:5432 igress from ecs"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_security_group_rule.allow_postgres_ecs_sg will be created
  + resource "aws_security_group_rule" "allow_postgres_ecs_sg" {
      + cidr_blocks              = [
          + "10.150.10.0/24",
          + "10.150.20.0/24",
        ]
      + description              = "Allow postgress egress"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.allow_postgres_egress_bastion_sg will be created
  + resource "aws_security_group_rule" "allow_postgres_egress_bastion_sg" {
      + cidr_blocks              = [
          + "10.150.10.0/24",
          + "10.150.20.0/24",
        ]
      + description              = "Allow postgres egress"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.allow_ssh_ingress_bastion_sg will be created
  + resource "aws_security_group_rule" "allow_ssh_ingress_bastion_sg" {
      + cidr_blocks              = [
          + "176.147.76.8/32",
        ]
      + description              = "Allow ssh igress"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.vpc.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "dev-default_SG"
        }
      + tags_all               = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "dev-default_SG"
          + "Terraform"   = "True"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "dev-eip"
        }
      + tags_all             = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "dev-eip"
          + "Terraform"   = "True"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "dev-igw"
        }
      + tags_all = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "dev-igw"
          + "Terraform"   = "True"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "dev-ngw"
        }
      + tags_all             = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "dev-ngw"
          + "Terraform"   = "True"
        }
    }

  # module.vpc.aws_route.private_nat_gateway will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route_table.private_rt will be created
  + resource "aws_route_table" "private_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev-private-route-table"
        }
      + tags_all         = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "dev-private-route-table"
          + "Terraform"   = "True"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public_rt will be created
  + resource "aws_route_table" "public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev-public-route-table"
        }
      + tags_all         = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "dev-public-route-table"
          + "Terraform"   = "True"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[0] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.150.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-eu-west-3a-private-subnet"
        }
      + tags_all                                       = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "dev-eu-west-3a-private-subnet"
          + "Terraform"   = "True"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[1] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.150.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-eu-west-3b-private-subnet"
        }
      + tags_all                                       = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "dev-eu-west-3b-private-subnet"
          + "Terraform"   = "True"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[0] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.150.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-eu-west-3a-public-subnet"
        }
      + tags_all                                       = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "dev-eu-west-3a-public-subnet"
          + "Terraform"   = "True"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[1] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-3b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.150.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-eu-west-3b-public-subnet"
        }
      + tags_all                                       = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "dev-eu-west-3b-public-subnet"
          + "Terraform"   = "True"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.150.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "dev-vpc"
        }
      + tags_all                             = {
          + "Author"      = "Antoine Sterna"
          + "Environment" = "Dev"
          + "Name"        = "dev-vpc"
          + "Terraform"   = "True"
        }
    }

Plan: 50 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_endpoint = (known after apply)
  + bastion_host = (known after apply)
  + db_host      = (known after apply)

```
</details>
*Pushed by: @Mysticx69, Action: `pull_request`*